---
kind: type
id: T:Autodesk.Revit.DB.DocumentValidation
source: html/dc5c35f3-c58d-b7bd-de1b-46497dfb237e.htm
---
# Autodesk.Revit.DB.DocumentValidation

Utility functions with document validation

## Syntax (C#)
```csharp
public static class DocumentValidation
```